!
!!
!!!
!?
!?!
"
#
$
%
'
''
'd
'll
're
's
've
(
)
*
+
,
-
--
.
...
/
0
1
10
100
10000
14
15
16
170
17th
19
19.
1960
1969
1980
1st
2
20
2003
2008
2010
2030
2050
20th
21st
24
25
3
30
370
40
40,000
4:00
5
50
6
60
7
75
8
80
85
89
90
99
:
;
?
?!
?!?
??
???
A
AAA
AIDS
APPLE
About
Above
Academic
According
Accordingly
Actually
Addiction
Adding
Additionally
Admittedly
Adolescents
Ads
Advertisement
Advertisements
Advertising
Africa
Africa.
African
After
Afterward
Aiding
Air-conditioners
Albert
Alike
All
Allowing
Almost
Along
Also
Alternatively
Although
America
American
Amir
An
And
Anima
Animal
Animals
Another
Any
Anybody
Anyone
Apart
Apparently
Apple
Archuleta
Argentina
Around
Art
Artist
Artists
Arts
As
Asia
Asian
Asians
Association
Assuming
At
Attending
Australia
Australian
Australians
Automatically
Averagely
B
BBC
Back
Bangladeshi
Barrier
Based
Basic
Basically
Basketball
Because
Becoming
Beethoven
Before
Beijing
Being
Believe
Beneficial
Benefit
Berlin
Beside
Besides
Better
Beyond
Big
Bill
Biodiversity
Biomedical
Birthday
Blatantly
Blood
Both
Boys
Brazil
Britain
British
British-ruled
Brother
Brunei
Buddha
Buddhism
Buddhist
Build
Building
Burning
Buses
Businessmen
But
Buying
By
CCTV
CCTVs
CEO
CNBC
CO2
Cambodia
Camp
Camp.
Canada
Canadian
Capital
Capitalism
Caring
Cars
Carter
Cartoon
Celebrity
Center
Central
Certainly
Challenges
Chanda
Changing
Channel
Charging
Chemistry
Chi
Childhood
Children
China
China.
Chinatown
Chinese
Choice
City
Classes
Classroom
Clear
Clearly
Click
Co-education
Co-operation
Coaching
Coca
Collectively
College
Columbus
Com
Communication
Company
Compared
Compassion
Competition
Competitive
Computer
Computers
Concerning
Concrete
Connection
Consequently
Consider
Consideration
Considering
Consumers
Contrary
Cooking
Council
Countries
Creative
Creativity
Crimea
Crimes
Criminals
Criticism
Critics
Cultural
Cup
Curie
Currently
Czech
Da
Daily
David
Definitely
Dell
Depending
Despicable
Despite
Developing
Development
Diamonds
Different
Digital
Discovery
Discussing
Disney
Disorder
Doesn
Doing
Dong
Dopamine
Dove
Driving
Due
During
Dwelling
E-mail
EBS
Each
Earning
Earth
Earth.
Economically
Edison
Education
Educational
Einstein
Electrical
Eleven
Ellis
Emergence
Employees
Engineering
English
English.
Enriching
Entertaining
Environment
Environmental
Equality
Equally
Ergo
Eric
Eric.
Especially
Etv
Europe
Europe.
European
Evaluating
Even
Eventually
Ever
Every
Everybody
Everyday
Everyone
Everythings
Exam
Excellent
Except
Exercise
Exercising
Exhaust
Experience
Expo
FAD
FIFA
FOXCONN
Facebook
Facebooks
Factor
Factories
Fail
Fairness
Fame
Families
Family
Female
Few
Finally
Financially
Finland
First
Firstly
Focusing
Football
For
Fortunately
Forums
Frank
Frequently
Friday
From
Further
Furthermore
Futhermore
Future
GHG
Gaining
Games
Gandhi
Gates
General
Generally
Genius
Georgia
Germany
Getting
Given
Giving
Global
Gone
Good
Google
Goverment
Government
Governments
Gradually
Great
Greek
Green
Greenhouse
Group
Growing
Gujarati
Gulf
Gutter
HIV
HU
Ha
Halo
Hard
Harmful
Have
Having
He
Health
Hence
Here
High
His
Historic
History
Ho
Holiday
Hollywood
Honestly
How
However
Human
Humans
Hunting
I
I'll
I'm
IBT
ICICI
IQ
IT
Idiots
If
Im
Imagination
Imagine
Importance
Importantly
Improvements
In
Including
Increasing
Increasingly
Indeed
India
India.
Indian
Indians
Indira
Individually
Individuals
Indonesia
Indonesians
Inevitably
Information
Initially
Innocent
Instead
Interacting
Interaction
Interestingly
International
Internet
Internet.
Interpersonal
Intrinsic
Investing
Iphone
Irak
Iran
Iron
Island
It
It's
Italian
Its
JCPenney
Jackson
Jadeite
Japan
Japan.
Japanese
Jeff
John
Jordan
Josh
Juries
Just
K-pop
Kevin
Khan
Knowledge
Kochhar
Korea
Korea.
Korean
LCD
LED
Labor
Lanka
Large
Last
Lastly
Latest
Latin
Law
Learner
Learning
Lee
Leisure
Let
Liberty
Life
Light
Like
Likewise
Lisa
Little
Living
London
Long
Looking
Lot
Luck
Luckily
Lying
MH
MIS
MNCs
MP3
MSN
Macy
Madame
Majority
Malaysia
Malaysian
Mall
Management
Many
Marathi
March
Margaret
Mari
Mary
Maybe
Me
Me.
Meanwhile
Medicare
Meditation
Meeting
Melancholia
Mentioned
Messenger
Methods
Michael
Michaelangelo
Mickey
Microsoft
Millan
Mind
Minh
Minion
Ministry
Mitigating
Mobile
Models
Modern
Mohammedanism
Mona
Money
More
Moreover
Moscow
Most
Mouse
Moving
Mr.
Much
Multinational
Museum
Music
My
NASA
NBA
Nanotechnology
Nasrin
National
Nations
Natural
Naturally
Needless
Nevertheless
New
Newspapers
Newton
Next
No
Nobody
Nonetheless
Nor
Normally
North
Not
Notable
Now
Nowaday
Nowadays
Nowdays
Nowhere
Obviously
Obviousness
Of
Old
Olympic
Olympics
On
Once
One
Onlines
Only
Or
Organization
Organizations
Osetia
Other
Otherwise
Our
Outdoor
Overall
Overcoming
Oxygen
Oxytocin
Padang
Palace
Palme
Parents
Part-time
Passing
Past
Pedro
People
Person
Personally
PhDs
Physical
Physics
Picasso
Pieter
Pigs
Place
Playing
Plus
Point
Politeness
Politian
Power
PowerPoint
Preserving
President
President.
Pressure
Preventative
Primarily
Primary
Prior
Probably
Professors
Proficiency
Projector
Projects
Protection
Public
Pupils
Putin
Queens
Rainforest
Raising
Rather
Reading
Reality
Recent
Recently
Reef
Regardless
Relating
Relatively
Rely
Removing
Republic
Research
Researchers
Researches
Restrictions
Right
Ronaldo
Rushdie
Russia
Russia.
Russian
SARS
SAT
SMS
Safely
Safety
Salman
School
Schools
Science
Scientific
Scientist
Scientists
Search
Second
Secondary
Secondly
See
Seeing
Serious
Seven
Shakespeare
Shanghai
Sharing
She
Shows
Similarly
Simply
Simultaneously
Since
Single
Skills
Skype
Sleeves
Smoking
So
Soccer
Social
Some
Someone
Something
Sometimes
South
Southeast
Southern
Soviet
Space
Speaking
Specifically
Spending
Sports
Sri
Star
Start
Starting
State
Stated
Statically
Statue
Still
Stress
Striking
Stroke
Student
Students
Studying
Success
Such
Sudan
Sudanese
Sunsilk
Supplementary
Suppose
System
TOEFL
TV
TV.
TVs
Tabloid
Taiwan
Take
Taking
Talking
Taslima
Tax
Taxation
Taxes
Teacher
Teachers
Technological
Technology
Teenagers
Telephones
Television
Test
Testing
Thailand
Thanks
That
Thatcher
The
Their
Then
There
Thereafter
Thereby
Therefore
These
They
Things
Think
Third
Thirdly
This
Thomas
Those
Though
Three
Through
Thursday
Thus
Tiger
Time
To
Today
Todays
Toefl
Together
Tokyo
Tom
Top
Totally
Tourism
Tourist
Trading
Traditional
Traffic
Training
Transportation
Travelling
Trong
Trumm
Truthfully
Try
Trying
Turkey
Turkish
Tussaud
Tv
Twitter
Twitters
Two
Tzu
U.S.
US
USA
Ultimately
Under
Underdeveloped
Understanding
Undoubtedly
Unemployed
Unemployment
Unfortunately
Union
Union.
United
Universities
University
Unlike
Using
VHS
Vacations
Vehicle
Via
Viber
Vietnam
Vietnamese
Viharas
Vinci
Violence
Virus
Visit
Visiting
Voice
WDTV
Walt
War
War.
Warming
Wars
Watching
We
Wealth
Web
What
Whatsapp
When
Whenever
Where
Whereas
Wherever
Whether
Which
While
Who
Why
Wide
Wikileaks
Wikipedia
With
Without
Women
Woods
Workers
Working
World
World.
Worse
Would
Writing
X
Yahoo
Yang
Year
Yet
York
York.
You
Young
Youngsters
Your
Zappa
Zoos
[
]
_
a
abandon
abbreviated
abbreviations
abetter
abiding
abilities
abilities.
ability
ability.
able
abnormal
about
about.
above
above-mentioned
above.
abovementioned
abroad
absence
absent
absolutely
absolved
absorb
absorbed
absorbing
abstract
absurd
abundance
abundant
abuse
abusive
academic
academically
academics
academy
accelerate
accelerated
accelerates
accept
acceptable
accepted
access
accessed
accessibility
accessible
accessing
accident
accidentally
accidents
acclaim
accommodating
accommodation
accompanied
accompany
accompanying
accomplish
accomplished
accomplished.
accomplishing
accomplishment
accomplishments
accordance
according
accordingly
accordingly.
account
account.
accountable
accounting
accounts
accounts.
accredited
accumulate
accumulated
accumulating
accumulation
accuracy
accuracy.
accurate
accusations
accuse
accused
accustomed
achieve
achieved
achievement
achievement.
achievements
achieves
achieving
aching
acid
acing
acknowledge
acknowledged
acknowledgement
acquaint
acquaintance
acquaintances
acquainted
acquire
acquired
acquiring
acquisition
across
act
acted
acting
action
action.
actions
actions.
active
actively
activeness
activities
activities.
activity
activity.
actor
actor/actress
actors
acts
actual
actually
acumen
acute
adapt
adaptability
adaptation
adapted
adapting
add
added
added.
addict
addicted
addiction
addictive
adding
addition
additional
address
address.
addresses
addressing
adds
adequate
adequately
adipose
adjust
adjusting
administration
admire
admired
admirers
admission
admit
admitted
admittedly
adolescence
adolescences
adolescent
adolescents
adopted
ads
adult
adult.
adulterating
adulthood
adults
adults.
advance
advance.
advanced
advancement
advancements
advances
advancing
advantage
advantage.
advantaged
advantageous
advantageously
advantages
advent
adventurousness
adverse
adversely
adversity
advertise
advertised
advertisement
advertisements
advertisers
advertising
advertising.
advice
advice.
advices
advisable
advisor
advocate
advocated
advocating
advocators
aesthetic
affair
affairs
affect
affected
affecting
affects
affluent
afford
affordability
affordable
afforded
aforementioned
afraid
after
afternoon
afterwards
afterwards.
again
again.
against
age
age.
aged
agenda
ages
ages.
aggravate
aggressive
agitate
ago
ago.
agree
agreed
agreement
agreement.
agrees
agricultural
agriculture
ahead
ahead.
aid
aided
aiding
aids
ailments
aim
aimed
aiming
aims
air
air.
aircraft
airlines
airport
albeit
alcohol
alcohols
alive
alive.
all
all-round
all.
alledged
alleging
allergy
alleviate
alleviated
alleviating
alleviation
allocate
allocated
allocations
allow
allowed
allowed.
allowing
allows
almost
alone
alone.
along
along.
aloud
already
already-high
also
also.
alter
alterations
altered
alternative
alternative.
alternatives
although
alway
always
am
amazed
amazing
ambience
ambition
ambitions
ambitious
ameliorating
amenities
amidst
among
amongst
amount
amounts
ample
amuse
an
analogous
analysing
analyze
analyzing
anatomy
ancestor
ancestors
anchors
ancient
and
angles
angry
animal
animals
animals.
animations
animlas
announced
announcement
announcements
annoyance
annoyed
annoying
annoying.
annum
anomalies
anonymous
another
another.
answer
answered
answering
answers
antique
anxieties
anxiety
any
anybody
anymore
anymore.
anyone
anyone.
anything
anytime
anytime.
anyway
anywhere
anywhere.
apart
apartment
apartment.
aplenty
apology
apparent
apparently
apparently.
appeal
appealing
appeals
appear
appearance
appearance.
appeared
appearing
appears
apperant
appetite
apple
appliances
applicable
applicants
application
applications
applied
apply
apply.
applying
appointment
appreciate
appreciation
apprehensive
apprentices
approach
approach.
approaches
appropriate
approve
approved
approximately
apps
apps.
aptitude
aquatic
architecture
arduous
are
are.
area
area.
areas
areas.
aren
argue
argued
argument
arguments
arid
arise
arises
arm
armed
around
around.
aroused
arrange
arranged
arranging
arrival
arrogant
arson
art
art.
articles
artifacts
artificial
artist
artist.
artistic
artists
artists.
arts
artwork
as
ascertain
ashes
asian
aside
asistant
ask
asked
asking
asleep
asleep.
aspect
aspects
aspects.
assemble
assert
assess
assessment
assign
assigned
assignment
assignments
assimilate
assimilated
assist
assistance
assistance.
assistant
assistants
assisting
assists
assit
assitance
associated
associates
associations
assumed
assure
assured
assures
asthma
astonishment
astoundingly
astray
astronauts
astronomy
asymmetry
at
at.
ate
athlete
athletes
athletics
atmoshphere
atmosphere
atmosphere.
atmospheric
atomic
attach
attachment
attack
attacked
attacks
attacted
attain
attained
attempt
attempt.
attempts
attend
attendance
attendances
attended
attending
attention
attention.
attentions
attentive
attire
attitude
attitudes
attract
attracted
attracting
attraction
attractions
attractive
attractive.
attribute
attributed
attributes
audience
audience.
audiences
auditorium
augment
aural
authentic
authoritarian
authoritative
authorities
authority
autism
autocratic
automatic
automatically
automation
automobile
automobiles
availability
available
available.
average
average.
avoid
avoidable
avoided
avoiding
awarded
aware
awareness
away
away.
awe
awesome
awesome.
axiomatic
babies
babies.
baboon
baby
baby.
bachelors
back
back.
backed
backfire
background
background.
backgrounds
backing
backpack
bacterias
bad
bad.
badly
baggers
balance
balance.
balanced
balances
balancing
ball
ban
bank
bank.
bankrupt
banned
banned.
banners
bar
bar.
bare
barely
barriers
bars
base
baseball
based
basic
basically
basics
basis
basis.
basketball
batch
batteries
batteries.
bay
be
be.
beach
bean
bear
bear.
beat
beaten
beats
beautiful
beautifying
beauty
beauty.
became
because
become
becomes
becoming
beef
beeline
been
before
before.
began
begin
begin.
beginners
beginning
behave
behavior
behavior.
behaviors
behaviour
behaviours
behind
being
being.
beings
belief
beliefs
believe
believe.
believed
believes
believing
belive
belligerent
belong
belonging
belongs
beloved
below
below.
belt
beneficed
beneficial
benefit
benefit.
benefited
benefiting
benefits
benefits.
beside
besides
best
best.
better
better.
bettering
between
beware
beyond
bias
biased
bicycle
bicycles
big
bigger
biggest
bike
biking
billion
bills
bills.
bio
biodiversity
biological
biology
biomechanical
biomedical
birds
birds.
bit
bitter
black
blackboard
blackboards
blame
blamed
blanket
blended
blending
blessed
blessing
blessing.
blind
blindly
block
blocking
blog
blood
bloody
blossom
blot
blue
blue.
boarder
boat
bodies
body
body.
bolsters
bombarded
bond
bonded
bonds
bone
book
book.
books
books.
bookstores
booming
boon
boost
boosted
boosting
boosts
border
borders
bored
boring
boring.
born
borne
borough
boss
boss.
bosses
both
both.
bottom
bought
bound
boundaries
bounded
box
boxes
boy
boys
boys.
brain
brain-storming
brain-washed
brains
brainstorming
brainwash
brake
branch
brand
brand.
brands
bravery
breach
break
break.
breakdown
breakfast
breakfasts
breaking
breaks
breakthrough
breakthroughs
breath
breath.
breathe
breathing
breeds
brick
bridge
bridging
brigade
bright
bright.
brighter
brilliant
bring
bringing
brings
brink
briskly
broad
broadcast
broaden
broadened
broader
broadly
brochures
broke
broken
broken.
brother
brought
browse
browser
browsing
brutal
buddies
budget
budget.
budgets
build
build-up
building
building.
buildings
buildings.
built
bulb
bulbs
bulk
bullock
bunch
burden
burdened
burdens
burgeoning
burglary
buried
burn-out
burned
burning
burring
burst
bursted
bus
bus.
buses
busier
business
business.
businesses
businessman
businessmen
busy
but
button
button.
buy
buy.
buying
by
by.
cabbage
cafes
cafés
cage
caged
cages
cake
cakes
calculate
calculation
call
called
calling
calls
calm
calmer
came
cameramen
cameras
cameras.
campaign
campaign.
campaigns
camping
campus
can
can't
can.
cancelled
cancer
cancer.
cancers
candidates
cannot
capabilities
capability
capable
capacity
capacity.
capital
captivate
captivity
captured
car
car.
carbon
cardiovascular
cards
care
care.
cared
career
career.
careers
careful
careful.
carefully
carefully.
carelessly
carried
carrier
carriers
carries
carry
carrying
cars
cars.
cart
cart.
cartoon
case
case.
cases
cases.
casting
casual
catalyze
catastrophic
catch
catching
categories
cater
cats
cattle
cattles
caught
cause
cause.
caused
causes
causing
cautious
ceasing
celebrate
celebrated
celebrities
celebrity
cell
cellphone
cellphones
cells
cellular
censorship
cent
cent.
center
centered
centers
centimeter
centre
centre.
centuries
century
century.
certain
certainly
certificate
certificates
certification
chained
chains
chair
chalkboard
challenge
challenge.
challenges
challenges.
challenging
champion
championship
chance
chance.
chances
change
change.
changed
changed.
changes
changes.
changing
channels
chaos
chaotic
character
character.
characteristic
characteristics
characters
characters.
charge
charge.
charged
charging
charitable
charities
charity
charm
charm.
chasing
chat
chatting
chauvinists
cheap
cheaper
cheaper.
cheaply
cheat
cheating
check
checkbook
checked
checking
cheered
cheerful
chemical
chemicals
chemistry
cherish
cherry
chiefly
child
child.
childhood
childhood.
childhoods
childish
children
children.
chips
choice
choice.
choices
cholesterol
choose
choose.
choosing
chopping
chores
chose
chosen
christmas
chronic
churn
cigar
cigarette
cigarettes
cinema
cinemas
circulation
circulations
circumstance
circumstances
circumstances.
circumstantially
cite
cities
cities.
citing
citizen
citizen.
citizens
city
city.
civil
civilians
civility
civilization
civilized
claim
claim.
claimed
clamp
clarify
class
class.
classed
classes
classes.
classic
classical
classified
classmate
classmates
classroom
classrooms
clause
clean
clean.
cleaning
cleanliness
clear
clear-cut
clearance
clearer
clearly
clearly.
clerks
clever
click
click.
clicks
clients
clients.
climate
climatic
climb
climbing
clinically
clips
close
close.
closed
closely
closeness
closer
clothes
clothes.
clothing
club
club.
clubs
clueless
cm
co-citizens
co-operation
co-operative
co-tenant
co-worker
co-workers
coach
coal
coast
codified
coexistence
coexistent
coffee
cogent
cohesion
cohesiveness
coin
cola
cold
coldly
collaborate
collaborations
collage
colleague
colleagues
collect
collected
collecting
collection
collector
college
college.
colleges
collisions
color
colorful
colors
colossal
colourful
combination
combine
come
come.
comedy
comes
comfort
comfortable
comfortable.
comfortably
comfot
coming
command
commence
comment
commerce
commercial
commercials
commercials.
commit
commitment
commitments
committed
committing
commodities
common
common.
commonly
communal
communicate
communicate.
communicated
communicating
communicatio
communication
communication.
communicational
communications
communities
community
community.
commute
commuter
commuting
companies
companies.
company
company.
comparable
comparatively
compare
compared
comparing
comparison
compatibility
compatible
compelled
compensate
compete
competence
competences
competency
competent
competently
competition
competition.
competitions
competitive
competiton
competitors
complain
complained
complaining
complaints
complement
complete
completely
completely.
completing
completion
complex
complexity
complicated
complicated.
compliment
complimentary
component
components
compose
composing
compound
comprehend
comprehending
comprehensible
comprehension
comprehensive
comprehensively
compromise
compromises
compulsory
computer
computer.
computerized
computers
computers.
comtemporary
concealed
concede
conceded
conceivable
conceive
concentrate
concentrates
concentrating
concentration
concept
concepts
concern
concern.
concerned
concerning
concerns
concerts
conclude
concludes
concluding
conclusion
conclusions
concurrently
condemned
condition
condition.
conditioner
conditioners
conditions
conditions.
conduce
conducing
conduct
conducted
conducting
cone
conferences
conferencing
confess
confidence
confidence.
confident
confidential
confidently
confine
confined
confirmed
conflict
conflicting
conflicts
conform
confront
confronted
confuse
confused
confused.
confusing
confusion
congestion
congratulate
congregate
connect
connected
connecting
connection
connection.
connections
conquer
conquered
cons
conscience
conscientious
conscious
consecutively
consensus
consent
consequence
consequences
consequential
consequently
conservation
conservative
conserve
consider
considerable
considerate
consideration
consideration.
considered
considering
consistent
consistently
console
consoled
conspicuous
constant
constantly
constitute
constitutes
constitutions
constrained
constrains
constraints
construct
constructing
construction
construction.
constructions
consular
consultation
consulting
consume
consumed
consumer
consumer-oriented
consumers
consuming
consumption
consumption.
contact
contact.
contacts
contain
contains
contaminated
contamination
contemporarily
contemporary
contend
content
content.
contentions
contents
contests
context
continent
continue
continued
continues
continues.
continuing
continuingly
continuous
continuously
contracting
contrarily
contrary
contrast
contribute
contributed
contributes
contributing
contribution
contributions
contributor
control
control.
controlled
controlling
controls
controversial
controversies
controversy
conundrums
convenience
convenience.
conveniences
convenient
conveniently
conventional
conventions
convergence
conversation
conversation.
conversations
conversations.
conversative
converse
converting
convey
conveyance
conveying
convicted
conviction
convince
convinced
convincing
cook
cooker
cookers
cooking
cooking.
cooks
cool
cooperate
cooperating
cooperation
cooperative
coordinated
coordination
cope
corals
core
corn
corner
corners
corporate
corporation
corporations
corpore
correct
correctly
correctly.
correlate
correspond
corresponding
corrupted
corrupting
cosmetic
cost
cost-effective
cost.
costly
costs
costs.
costume
costumes
costumes.
couch
cough
could
couldn
counseling
count
counterparty
counties
countless
countries
countries.
country
country.
countryside
countrysides
county
couple
coupled
courage
course
course.
courses
courses.
court
courts
cousin
cover
coverage
covering
cows
crafts
cram
crashed
craving
crazier
cream
creat
create
created
created.
creates
creating
creation
creation.
creational
creative
creative.
creatively
creativity
creativity.
creator
creature
creatures
credential
credentials
credibility
credit
crews
cricket
cries
crime
crime.
crimes
criminal
criminals
crisis
criteria
criterion
critical
criticise
criticises
criticism
criticism.
criticize
critics
crocodile
crops
crowd
crowded
crowed
crucial
crucible
crude
crudity
cruel
cruelty
crying
cuisines
cultivate
cultivating
cultivation
cultural
culturally
culture
culture.
cultures
cumbersome
cup
curb
curbed
curbs
cure
cured
curiosity
curious
current
currently
curricula
curriculum
curriculums
custom
customer
customers
customers.
customs
customs.
cut
cut-throat
cute
cutting
cutting-edge
cyber
cyberspace
cycle
cycle.
cylinder
dad
daily
damage
damaged
damages
damaging
dams
dance
dance.
danced
dancers
dancing
danger
dangerous
dangerous.
dark
dark.
data
date
dates
daughters
daunted
daunting
day
day.
daylife
days
days.
daze
dead
deadline
deadline.
deal
deal.
dealing
dealings
deals
death
death.
deaths
debatable
debate
debate.
debated
debates
debating
debt
decade
decades
deceived
decent
decently
decide
decided
decides
deciding
decipher
decision
decision.
decisions
decisions.
decisive
declare
decline
declined
decrease
decreased
decreases
decreasing
dedicate
dedicated
dedication
deduction
deed
deeds
deep
deepen
deeper
deeply
defeated
defeating
defeats
defence
defend
defendant
defense
defenseless
deficiency
define
definitely
deforestation
degree
degree.
degrees
delay
delay.
delayering
delegating
delicate
delicious
delight
deliver
deliverable
delivered
delivering
delivers
delivery
demand
demanded
demands
demerit
demerits
democratic
demonstrate
demonstrated
demonstrates
demonstration
demonstrations
denied
dentist
deny
denying
department
department.
departments
depend
dependable
dependence
dependent
depending
depends
depleted
depleting
depletion
deposit
depress
depressed
depression
deprive
deprived
depth
derives
derogatory
describe
descriptions
deseases
deserts
deserve
deserve.
deserves
deserving
design
designed
designers
designing
designs
desirable
desire
desired
desires
desk
desperate
despite
destabilize
destination
destination.
destinations
destined
destiny
destroy
destroyed
destroyers
destroying
destroys
destruct
destruction
destructive
detail
detail.
detailed
details
details.
detaining
detect
detergent
deteriorate
deteriorating
determinant
determination
determine
determined
determines
detriment
detrimental
devastate
devastated
devastating
develop
develope
developed
developing
development
development.
developments
develops
deviate
device
devices
devised
devising
devote
devoted
dextrous
diabetes
dialed
diamond
diamonds
did
did.
didn't
die
die.
died
died.
diet
diet.
diets
differ
difference
differences
different
different.
differentiate
differently
difficult
difficulties
difficulty
digest
digital
dignity
digress
dilemma
diligent
diligently
dim
diminish
diminishing
dinner
dioxid
dioxide
dioxides
dire
direct
directing
direction
direction.
directly
directly.
directors
dirty
disabilities
disabled
disadvantage
disadvantaged
disadvantages
disagree
disagreed
disagreement
disagreements
disappear
disappoint
disappointed
disappointing
disappointment
disappointment.
disappointments
disasters
disavow
disbelief
disc
discarded
discharge
discharging
discipline
disciplines
disclose
disclosing
discomfort
discontented
discount
discounts
discourage
discouraged
discover
discovered
discoveries
discovering
discovery
discretion
discrimination
discuss
discuss.
discussed
discussing
discussion
discussions
disease
diseases
disgrace
disgusted
disgusting
dish
dish-washing
disheartened
dishes
disinform
dismantle
disorder
disorders
disorientated
dispensable
display
displayed
displaying
displays
disposable
dispose
disputes
disregard
disregarded
disregarding
disrespectable
disrupt
disrupted
dissatisfaction
dissatisfied
disseminating
dissidents
dissipation
dissolves
distance
distance-learning
distances
distant
distinct
distinction
distinctive
distinguish
distinguished
distinguishes
distinguishing
distorted
distract
distracted
distraction
distractions
distress
distribute
distributed
distributing
district
districts
disturb
disturbed
dive
diverse
diversion
diversity
divert
diverting
divide
divided
division
divisions
divorce
divorces
do
do.
doctor
doctor.
doctors
doctrine
document
documentaries
documentary
documents
does
does.
doesn't
dog
dogs
dogs.
doing
doing.
doing.In
doings
dollar
dollars
dollars.
domain
domestic
dominate
dominated
don
don't
donate
donation
done
done.
donkeys
door
dorm
dormitories
dormitory
dos
doubt
doubts
down
down.
downfall
downs
downside
downsides
draining
drama
dramas
dramatic
dramatically
dramaticly
drastically
draw
drawback
drawbacks
drawing
drawing.
drawings
drawn
draws
dream
dream.
dreamed
dreams
dreams.
dress
dressing
drift
drilling
drink
drink.
drinking
drive
driven
drivers
drivers.
drives
driving
drone
drop
drop.
dropouts
dropping
drought
drown
drug
drugs
drugs.
drum
due
dull
dullness
dumped
durability
durability.
duration
during
duties
duty
dwellers
dwindle
dying
dying.
dynamic
dynamics
dynamite
e-books
e-learning
e-mail
e-mail.
e-mails
e.g.
each
eager
earlier
early
early.
earn
earned
earning
earnings
earth
earth.
earthquake
ease
easier
easier.
easiest
easily
easily.
easiness
easing
easy
easy-to-cook
easy.
eat
eaters
eating
eating.
eclipse
eco-friendly
eco-system
ecological
ecology
economic
economical
economically
economics
economies
economists
economy
economy.
ecosphere
ecosystem
ecosystems
ecotourism
edge
edged
editor
educate
educated
educates
educating
educatio
education
education.
educational
educations
educators
effect
effect.
effected
effective
effective.
effectively
effectiveness
effects
effects.
efficiencies
efficiency
efficiency.
efficient
efficiently
effort
efforts
efforts.
eight
eight-hour
either
elaborate
elaborately
elaboration
elderly
elders
electric
electrical
electricity
electronic
electronics
elegant
element
elementary
elements
elevate
elevated
elevators
elicit
eligible
eliminate
eliminated
eliminating
elimination
else
else.
email
email.
emails
emails.
emanates
emancipate
embarrassed
emerge
emergency
eminent
emission
emissions
emit
emitted
emoticons
emotion
emotional
emotionally
emotions
empathy
emphasis
emphasize
emphasized
employ
employee
employees
employees.
employer
employers
employment
empowered
empowerment
empty
enable
enabled
enables
enclosures
encompassed
encounter
encountering
encourage
encouraged
encouragement
encouragements
encourages
encouraging
encroachment
end
end.
endangered
endangering
endangers
endeavor
endeavored
endeavors
ended
ending
endings
endless
endorse
endow
ends
ends.
endurance
enduring
energetic
energy
energy.
enforce
enforced
enforcement
enforcing
enfranchised
engage
engaged
engaging
engineer
engineering
engineers
engines
enhance
enhanced
enhancement
enhances
enhancing
enjoy
enjoy.
enjoyable
enjoyable.
enjoyably
enjoyed
enjoying
enjoyment
enjoyment.
enlarged
enlightening
enlightenment
enormous
enormously
enough
enough.
enrich
enriched
enriches
enriching
enroll
enrollment
enrolment
ensemble
ensue
ensure
ensured
ensuring
enter
entering
enterprise
enterprises
enterprising
entertain
entertained
entertaining
entertainment
entertainment.
entertainments
enthusiasm
enthusiastic
entire
entirely
entrance
entrepreneurs
entwined
environmen
environment
environment-friendly
environment.
environmental
environmental-friendly
environmentalists
environmentally
environmentally-friendly
environments
environments.
epidemic
episodes
episodes.
epitome
equal
equality
equalize
equally
equals
equator
equestrian
equilibrium
equip
equipment
equipment.
equipments
equipped
equipping
equivalent
era
eradicate
eras
erased
erode
eroding
eroticism
errors
erupted
escape
escaping
especially
essay
essence
essential
essentially
establish
established
establishes
establishment
estate
esteem
estimate
estimated
estimations
esy
etc
etc.
ethic
ethical
ethically
ethics
ethnic
etiquettes
european
evaluate
evaluated
evaluating
evaluation
even
event
event.
events
events.
eventually
eventually.
ever
ever-increasing
ever.
every
everybody
everybody.
everyday
everyday.
everyone
everyone.
everything
everything.
everywhere
everywhere.
evidence
evidences
evident
evolution
evolved
evolving
exact
exactly
exaggerate
exaggerated
exaggeration
exam
exam.
examination
examinations
examine
example
example.
examples
exams
exams.
exceed
exceeds
excel
excellence
excellent
except
exception.
exceptional
exceptions
excess
excessive
excessively
exchange
excited
excitement
exciting
exciting.
exclusive
excuse
excuse.
excused
executed
execution
executive
executives
exercise
exercise.
exercises
exercising
exert
exerting
exhaled
exhaust
exhausted
exhausting
exhibit
exhibitions
exhibits
exist
exist.
existed
existence
existence.
existences
existing
exists
exited
exotic
expand
expanded
expanding
expands
expansion
expect
expect.
expectancy
expectation
expectations
expected
expects
expedites
expels
expenditure
expense
expenses
expensive
expensive.
expensiveness
experience
experience.
experienced
experiences
experiences.
experiencing
experiment
experimental
experiments
expert
expertise
experts
expirience
explain
explained
explaining
explains
explanation
exploit
exploitation
exploited
exploiting
exploration
explore
exploring
export
exporters
expose
exposed
exposing
exposure
exposured
express
expressed
expression
expression.
expressions
extend
extended
extending
extensive
extensively
extent
external
extinct
extinction
extra
extra-curriculum
extract
extraction
extracurricular
extraneous
extraordinarily
extraordinary
extreme
extremely
extremes
extrinsic
eye
eyes
eyes.
eyesight
fabricated
fabulous
facade
face
face-to
face-to-face
face.
facebook
facebook.
faced
faces
facial
facilitate
facilitates
facilitating
facilities
facilities.
facility
facing
fact
factor
factor.
factories
factors
factory
facts
facts.
fail
fail.
failed
failing
failure
failure.
failures
fair
fair.
fairly
fairness
fairy
fake
fall
falling
false
fame
familiar
familiarity
familiarize
families
families.
family
family.
famine
famous
fan
fancies
fans
fans.
fantastic
far
far-off
faraway
fares
farm
farmers
farming
farmland
farmlands
farms
fascinating
fascination
fashion
fast
fast-food
fast-paced
fast.
faster
faster.
fat
fatal
fatality
fate
father
fatigue
fault
fault.
fauna
favor
favorable
favorably
favorite
favour
favourite
fawn
fear
fearless
fears
feasible
feature
features
features.
fed
fee
fee.
feed
feedback
feedbacks
feeding
feel
feel.
feeling
feelings
feelings.
feels
fees
fees.
feet
feet.
fell
felling
fellow
fellowman
fellowship
felony
felt
female
females
fenced
fencing
ferries
fertilized
fertilizers
festival
few
fewer
fiance
fiction
fictions
field
field.
fields
fields.
fierce
fifty
fifty-fifty
fifty-five
fight
fighting
fights
figure
figured
filed
fill
filled
film
films
filter
filtering
filters
final
final.
finally
finance
financial
financially
financing
find
finding
findings
finds
fine
fine.
finish
finished
finished.
finishing
fire
firearms
fired
fireworks
firm
firmly
firms
first
first.
fish
fishermen
fission
fit
fit.
fitting
five
fix
fix.
fixed
fixer
flags
flamable
flash
flat
flat.
flesh
flexibility
flexible
flight
flights
flocking
flood
flooding
flora
flourish
flourishing
flow
flowcharts
flowers
flowing
flows
flu
fluctuated
fluency
fluently
fluid
fly
flying
focus
focused
focuses
focusing
fog
folks
follow
follow.
followed
following
following.
follows
fond
food
food.
foods
foods.
foot
football
football/basketball
for
for.
force
force.
forced
forces
forcibly
forcing
forecast
foreign
foreigners
foremost
foreseeable
forest
forests
forever
forever.
forget
forgettable
forgive
forgot
forgotten
form
form.
formal
formalities
formed
former
forming
forms
formula
formulas
forth
forth.
fortifies
fortify
fortunate
fortune
forty
forums
forward
forward.
fossil
foster
fosters
found
foundation
founder
four
fragile
frame
fraternal
frauds
fraudulent
free
free.
freedom
freedom.
freeing
freely
french
frenetic
frequency
frequent
frequently
frequently.
fresh
fried
friend
friend.
friendly
friends
friends.
friendship
friendship.
friendships
frightening
from
front
frown
fruitful
fruits
frustrate
frustrated
frustrates
frustrating
frustrations
fuel
fuels
fulcrum
fulfil
fulfill
fulfilled
fulfilling
fulfillment
fulfills
full
full-length
fully
fume
fumes
fun
fun.
function
function.
functionality
functions
fund
fundamental
fundamentally
funded
funding
funds
funny
furnish
further
furthermore
fusion
futile
future
future.
gadget
gadgets
gain
gained
gaining
gains
galleries
gam
game
game.
gamer
games
games.
gaming
gang
gap
garbage
garbage.
garner
gas
gas.
gases
gasoline
gasses
gather
gathering
gave
geek
gel
gender
genders
gene
general
generally
generate
generated
generating
generation
generation.
generations
generous
genetic
genetically
geniuses
genre
genuine
geographical
geography
german
germs
get
get.
gets
getting
gift
gift.
gifts
gigantic
giraffe
girl
girl.
girlfriend
girlfriend.
girls
give
give.
given
gives
giving
glaciers
glamorous
glamour
global
globalisation
globalization
globalized
globe
globe.
gloomy
go
goal
goal.
goals
goals.
god
goes
going
going.
gold
gone
gone.
good
good.
goods
goods.
goodwill
google
gorgeous
gorvernment
gossip
gossips
got
gotten
goverment
governmen
government
government.
governmental
governments
grab
grabs
gradate
grade
grades
grading
gradual
gradually
graduate
graduated
graduates
graduating
graduation
graduations
grammar
grandparents
granted
granted.
grants
graphs
grasp
grasped
grasping
grate
grateful
grating
gravity
great
great.
greater
greatest
greatly
greed
green
greenhouse
greeted
grew
grievously
ground
groundless
grounds
group
group.
groups
groups.
grow
growing
grown
grows
growth
growth.
guarantee
guaranteed
guardian
guess
guidance
guide
guided
guidelines
guilt
guilty
guilty.
guitar
guitar.
gun
gun.
guns
guns.
guy
gym
gyms
habit
habit.
habitants
habitat
habitats
habits
habits.
had
had.
hadn
hailed
hair
half
halted
hand
hand.
handcraft
handicrafts
handle
handled
handling
handmade
hands
hands-on
handwriting
hang
hanging
happen
happen.
happened
happened.
happening
happening.
happenings
happens
happens.
happier
happier.
happiest
happiness
happiness.
happing
happy
happy.
hard
hard-work
hard-working
hard.
hardcore
harder
harder-working
harder.
hardly
hardship
hardworking
harm
harmed
harmful
harmonious
harmony
harms
harsh
harvest
has
has.
hasn
hassles
hastily
hasty
hateful
hates
hatred
hats
have
have.
haven
having
hazard
hazardous
hazards
he
he/she
head
head.
headaches
heading
heads
heal
health
health-care
health.
healthcare
healthfulness
healthier
healthiness
healthy
healthy.
hear
heard
heard.
hearing
heart
heart-related
hearts
heat
heating
heavier
heavily
heavy
hectic
heel
heinous
held
help
help.
helped
helpful
helpful.
helping
helpmates
helps
hence
her
her.
here
here.
heritage
heritages
hero
hesitate
hesitation
hidden
hide
hiding
high
high-end
high-paying
high-quality
high-ranking
high-tech
high.
higher
higher.
highest
highlight
highlighted
highly
highly-productive
highway
highways
hiking
him
him.
him/her
him/herself
himself
himself.
himself/herself
hinder
hindrance
hire
hired
hiring
his
his/her
historic
historical
histories
history
history.
hit
hitting
hobbies
hobby
hold
holding
holds
holiday
holiday.
holidays
home
home.
homeland
homelessness
homes
homes.
hometown
homework
homework.
hone
honestly
honestly.
honesty
honored
hooligans
hoot
hope
hoped
hopes
hoping
horizon
horizons
hormone
horrendous
horror
horrors
horses
hospital
hospitality
hospitals
host
hostel
hostels
hot
hot.
hotel
hotel.
hotels
hotter
hour
hour.
hours
hours.
house
house.
household
households
housekeepers
houses
houses.
housewife
housewives
housework
housing
how
however
however.
huge
huge.
human
human.
humane
humaneness
humanities
humanity
humanity.
humankind
humans
humans.
humorous
hundred
hundreds
hunger
hunt
hunters
hunting
hunting.
huntings
hurdle
hurdles
hurried
hurry
hurt
hurt.
hurtful
hurting
hurts
husband
husbands
hydro
hydroelectricity
hygienic
i
i.e.
iBT
iPads
ice
idea
idea.
ideal
ideas
ideas.
identified
identify
identifying
identity
ideology
idiom
idioms
idol
idolize
idols
if
ignorance
ignore
ignored
ignoring
ill
illegal
illegal.
illegally
illiteracy
illness
illnesses
illogical
illusion
illustrate
illustrated
illustrates
illustration
image
image.
images
images.
imagination
imagination.
imagine
imagine.
imagined
imbalance
imitate
imitated
imitating
immature
immaturity
immediate
immediately
immediately.
immense
immerse
immigrant
immigrants
immigrated
immigration
imminent
immodest
immoral
impact
impact.
impacting
impacts
impair
impart
imparted
impatient
impeded
impeding
imperative
imperialistic
imperiling
implant
implement
implemented
implementing
implements
implication
implications
imply
impolite
import
importance
important
important.
importantly
imported
importent
impose
imposed
imposes
imposing
impossible
impoverished
impracticability
impractical
impressed
impresses
impression
impression.
impressions
impressive
imprisoned
imprisonment
improper
improve
improve.
improved
improvement
improvement.
improvements
improves
improving
imprudence
imprudent
impulsively
in
in-born
in-depth
in-touch
in.
inaccessible
inaccurate
inactivity
inadequate
inappropriate
inasmuch
incapable
incent
incentive
inch
incident
incidents
incline
inclined
include
included
includes
including
incoherent
income
income.
incomes
incoming
incompetence
incompetent
incomplete
inconvenience
incorporated
incorporation
incorrect
incorrectly
increase
increased
increases
increasing
increasingly
incredible
indeed
indefinitely
independence
independency
independent
independently
indicate
indicated
indicates
indicating
indifferent
indirect
indirectly
indispensable
indispensible
indisputable
individual
individualism
individuality
individually
individuals
indoor
indoors
indulge
industrial
industrialized
industries
industrious
industry
industry-related
industry.
inefficient
inessential
inevitable
inevitably
inexcusable
inexhaustible
inexpensive
infectious
infer
inferior
inferiors
infinite
inflation
inflict
influence
influenced
influences
influencing
influential
influx
inform
informal
informatin
information
information.
informative
informed
informing
infrastructure
infrastructures
ingenious
ingrained
ingredients
inhabitants
inhale
inhales
inherit
inherited
inhumane
initial
initially
initiated
initiatives
injected
injection
injured
injuries
innate
inner
innocent
innovation
innovations
innovative
input
inroads
insalubrious
insanity
inside
inside.
insight
insignificantly
insist
insistence
insisting
insists
insomnia
inspiration
inspirational
inspirations
inspire
inspired
inspires
inspiring
inspiring.
instability
installation
installed
instance
instance.
instances
instant
instantly
instead
instead.
instilled
instinct
instincts
institute
institutes
institution
institutions
instructions
instructions.
instructive
instructor
instructors
instrument
instrumental
instruments
insufficient
insure
intake
intangible
integral
integrated
integration
intellectual
intellectuals
intelligence
intend
intended
intense
intensify
intensive
intensively
intent
intention
intentionally
intentions
interact
interacting
interaction
interactions
interactive
intercepted
interchangeably
interest
interest-free
interest.
interested
interested.
interesting
interesting.
interests
interests.
interfere
interfered
interfering
internal
internation
international
internationalized
internationally
internet
internet.
interns
internship
internships
interpersonal
interplay
interpret
interpretation
interpreter
interpreters
interrelate
interrupt
interrupting
intervention
interview
interviewing
interviews
intimacy
intimate
into
intolerable
intolerant
intoxicants
intrigued
intrinsic
introduce
introduced
introducing
introduction
introvert
intruded
intruders
invaded
invalid
invaluable
invent
invented
inventing
invention
inventions
inventiveness
inventors
invest
invested
investigating
investigation
investigations
investing
investment
investment.
investments
invite
invited
invites
inviting
involve
involved
involves
involving
irrational
irreplaceable
irrespective
irresponsibility
irresponsible
irreversible
irrevocable
irritates
is
is.
island
islands
isms
isn
isolated
isolation
issue
issue.
issues
issues.
it
it's
it,
it.
items
items.
its
itself
itself.
ivory-tower
jade
jam
jams
jazz
jealous
jealousy
jeopardized
jeopardizes
jeopardizing
jet
jets
jewels
job
job.
jobless
jobs
jobs.
jockeys
jog
jogging
join
joined
joining
joking
journalism
journalists
journeys
joy
joy.
joyful
judge
judged
judgement
judges
judging
judgment
judgments
judicial
jump
jumping
jungles
junior
junk
juridical
juries
jurisdiction
jury
just
justifiable
justifications
justify
justing
juveniles
keen
keep
keeping
keeps
kept
key
keys
khmer
kicking
kicks
kid
kidnapping
kids
kill
killed
killer
killing
kills
kilogram
kilometers
kin
kind
kind.
kindergarten
kinds
kinetic
king
kingdom
kitchen
kitchen.
kitchens
kneading
knees
knees.
knew
know
know.
knowing
knowledge
knowledge.
known
known.
knows
koala
lab
labelled
labor
laboratories
laboratory
laborers
labors
labour
labours
lack
lacking
lacks
lactation
laden
lag
lagging
laid
lakes
land
land.
lands
landscape
landscapes
lane
language
language.
languages
languages.
languge
laptop
large
larger
largest
last
lasted
lasts
late
later
latest
latter
latter.
laud
laudable
laugh
laughing
launching
law
law.
laws
laws.
lawyer
lawyers
layer
layout
lazier
lazy
lazy.
lead
leader
leader.
leaders
leadership
leading
leads
leaf
leaflets
leak
leaked
leaking
lean
learn
learn.
learned
learned.
learner
learners
learnin
learning
learning.
learns
learnt
least
leave
leave.
leaves
leaving
lecture
lecturer
lecturers
lectures
led
left
leftovers
legal
legalized
legendary
legislate
legs
leisure
lend
length
lengthen
leopard
les
less
less-used
less.
lessen
lesser
lesser-known
lesson
lessons
lessons.
let
lethal
lethargic
letter
letters
letting
level
level.
leveled
levels
levels.
liable
liberal
liberate
liberated
liberties
libraries
library
library.
licenses
lies
life
life-long
life.
lifelong
lifestyle
lifestyle.
lifestyles
lifts
light
lighter
lightning
lights
lightweight
like
like.
liked
liked.
likelihood
likely
likes
limbs
limelight
limit
limit.
limitation
limitations
limited
limited.
limiting
limitless
limits
limits.
limp
line
line.
lines
lingers
linguistic
link
linkage
linked
lion
lions
liquidation
list
list.
listed
listen
listeners
listening
lit
literaly
literature
literature.
little
live
live.
lived
livers
lives
lives.
living
living.
load
loads
loafing
loan
loans
local
locally
locals
locate
located
locates
locating
location
location.
lodging
log
logical
lone
loneliness
long
long-distance
long-lasting
long-term
long-time
longer
longer-term
longer-than-usual
longer.
longest
longevity
look
looked
looking
looks
loose
lord
lose
lose.
loser
loser.
loses
losing
loss
loss.
lost
lost.
lot
lot.
lots
lottery
loud
loudly
love
love.
loved
lovers
loves
low
low-level
low.
lower
luck
luck.
luckier
lucky
lucky.
lunch
lung
lungs
lure
luxuries
luxurious
luxury
lying
lyric
m
machine
machine.
machineries
machinery
machines
machines.
macro-economic
made
made.
magazine
magazines
magic
magnificent
mail
mail.
mails
main
main-stream
mainly
maintain
maintaining
maintenance
major
majored
majoring
majority
majors
make
makers
makes
making
male
males
malfunction
malicious
mall
mall.
malls
man
man/woman
manage
managed
management
management.
manager
manager.
managers
managing
manipulated
manipulation
mankind
manner
manner.
manners
manpower
manual
manufacture
manufacturer
manufacturing
many
many.
maple
marble
marine
market
market.
marketing
marketplace
markets
marks
marks.
marred
marriage
married
marveled
mass
masses
massive
massively
master
mastered
mastering
masterpiece
masters
match
match.
matches
matching
material
material.
materialistic
materials
materials.
math
mathematician
mathematics
maths
matter
matter.
matters
mature
matured
maturity
maximize
maximum
may
maybe
me
me.
meal
meal.
meals
meals.
mean
meaning
meaning.
meaningful
meaningless
meanings
means
means.
meant
meantime
meanwhile
measure
measurement
measures
measures.
meat
mechanical
mechanics
mechanism
medal
media
media.
medical
medicals
medication
medications
medicine
medicine.
medicines
mediocre
meditation
medium
meet
meeting
meetings
meets
meliorate
melodies
melting
member
member.
members
members.
memeber
memories
memories.
memorising
memorize
memorizing
memory
men
men.
mental
mentally
mention
mentioned
mentioning
mentions
mentoring
merchandise
mere
merely
merit
merits
message
message.
messages
messages.
messaging
messy
met
metal
meter
method
method.
methodology
methods
metropolis
mettle
microscopic
microwave
microwaves
middle
midnight
midnight.
might
migrate
migration
milch
mile
mile.
miles
military
milk
milk.
million
millions
mills
mimic
mind
mind.
minded
minds
minds.
mindset
mine
mineral
minimize
minimized
minimum
mining
ministry
minor
minorities
minority
minute
minutes
minutes.
miraculous
mirror
misbehave
misbehaving
miscalculation
miscarried
misdeeds
miserable
miserably
misery
misguide
misinterpretation
mislead
misleading
misled
miss
missed
missiles
missing
mission
missions
mistake
mistake.
mistakes
mistakes.
mistrust
misunderstand
misunderstanding
misunderstandings
mixed
mobile
mobiles
mobilization
mode
model
model.
models
models.
modems
moderate
moderation
modern
modernity
modes
modest
modification
modified
modifying
module
module.
mold
mom
moment
moment.
moments
monetary
money
money.
monitored
monitoring
monitors
monopolistic
monopolization
monotonous
monotony
monoxide
monsters
month
month-long
month.
monthly
months
months.
monumental
monuments
mood
moon
moral
morale
more
more.
moreover
morning
morning.
mortality
mortgage
most
most.
mostly
mostly.
moth
mother
motherhood
motivate
motivated
motivates
motivation
motivation.
motivational
motivators
motor
motorbikes
motorcycles
mountain
mountains
mouse
mouth
move
move.
moved
movement
movements
movie
movie.
movies
movies.
moving
mp3
msn
much
much.
multi-aspect
multicultural
multifunctional
multimedia
multinational
multiple
multiple-choice
multiplies
multiracial
multitude
mummy
murder
murdered
murders
muscles
muse
museum
museums
music
music.
musical
musically
musicals
musician
musicians
must
must-haves
must.
mutual
my
myopia
myself
myself.
myspace
mysterious
mysteriously
mystique
name
named
namely
names
nano
narrowed
narrowing
nation
nation.
national
nationalist
nationality
nationally
nations
native
natives
natural
naturally
nature
nature.
natured
navigation
near
nearby
nearly
neat
neccessarily
neccessary
necessarily
necessary
necessary.
necessities
necessity
need
need.
needed
needed.
needing
needless
needs
needs.
needy
nefarious
negative
negative.
negatively
neglect
neglected
neglecting
negotiating
negotiation
negotiations
neighbor
neighborhood
neighborhood.
neighbors
neither
nervous
net
net.
netizens
network
network.
networking
networks
neurologists
neuron
never
nevertheless
new
newfangled
newly
news
news.
newspaper
newspapers
newspapers.
next
nice
night
night.
nightmares
nights
nights.
nine
no
no.
noble
nobody
noise
noisiness
nominated
non
non-academic
non-environmentally
non-governmental
non-human
non-native
non-profit
non-renewable
non-smokers
non-smoking
non-stop
non-tangible
non-verbal
none
none.
nonetheless
nonrenewable
nonsensical
noodle
nor
normal
normality
normally
north
nosiness
not
not.
notable
notably
note
note.
notes
nothing
nothing.
notice
noticeable
noticed
noticing
notion
notions
notorious
nourish
nourishment
novel
novels
now
now-a-days
now.
nowadays
nowadays.
noxious
nuclear
number
number.
numberless
numbers
numbers.
numerous
nurses
nurture
nurturing
nutrients
nutrition
nutritious
nutshell
obesity
obessed
obey
object
objective
objectively
objectives
objects
objects.
obligate
obligated
obligation
obligatorily
obligatory
obliged
observation
observation.
observations
observe
observed
observing
obsessed
obsessing
obstacle
obstacles
obtain
obtained
obtaining
obvious
obvious.
obviously
occasionally
occasionally.
occasions
occupation
occupation-related
occupied
occupy
occur
occurred
occurs
ocean
oceans
ocial
of
of-course
of.
off
off-campus
off.
offence
offend
offended
offender
offenders
offensive
offer
offer.
offered
offering
offers
office
office.
officers
offices
official
officials
offspring
offsprings
often
oil
oil.
okay
old
old-fashioned
old.
olden
older
older.
on
on-line
on.
once
once.
one
one-third
one-way
one.
ones
ones.
oneself
online
online.
onlooker
only
only.
onto
onwards
open
open-minded
opened
opening
operated
operates
operating
operational
opine
opinion
opinion.
opinions
opinions.
oppertunity
opponents
opportunities
opportunities.
opportunity
opportunity.
oppose
opposing
opposite
opposite.
opposition
opprotunities
opt
optimal
optimize
option
option.
optional
options
options.
or
oral
orbit
orchestrated
order
ordering
orders
orders.
ordinary
organic
organisation
organisations
organised
organising
organization
organizations
organize
organized
organizer
